<center>Name : Syeda Fatima <br>
Email : FatimaZahraAIL@hotmail.com<br>
Github : SyedaFatima55<Br>
Title : Project Practices</center>

Python Data Analysis and Data Cleaning

Step 1: Install Libraries

In [3]:
#Install Libraries
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: C:\Users\HP\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [4]:
%pip install numpy

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: numpy in c:\users\hp\appdata\local\packages\pythonsoftwarefoundation.python.3.12_qbz5n2kfra8p0\localcache\local-packages\python312\site-packages (2.2.3)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: C:\Users\HP\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.12_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

Step 2 : Import necessary libraries

In [7]:
import pandas as pd

In [8]:
import numpy as np

Step 3 : Load the CSV data into a DataFrame

In [9]:
df=pd.read_csv('data.csv')

In [10]:
df

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

Display First Five Rows

In [11]:
print(df.head())

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

Step 4 : Check Missing Values

In [12]:
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

Step 5 : Fill Missing values in the 'Salary' column with the mean salary

In [13]:
var= df['Salary'].mean()
df['Salary'].fillna(var, inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_19584\2066646306.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(var, inplace=True)

In [18]:
df['Salary'].isnull().sum()

np.int64(0)

In [47]:
var1= df['Salary'].mean()
df['Salary'].fillna(var1, inplace=True)

In [48]:
df['Salary']

0     1.150000e+05
1     3.500000e+04
2     5.000000e+04
3     7.000000e+04
4     1.500000e+06
5     1.725333e+05
6     2.000000e+04
7     1.150000e+05
8     3.500000e+04
9     1.725333e+05
10    7.000000e+04
11    9.000000e+04
12    1.100000e+05
13    2.000000e+03
14    1.600000e+04
15    1.700000e+05
16    1.900000e+05
Name: Salary, dtype: float64

In [22]:
df['Age'].isnull().sum()

np.int64(1)

In [64]:
var= df['Age'].median()
df['Age'].fillna(var, inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_19584\3875676737.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(var, inplace=True)

In [65]:
df['Age'].isnull().sum()

np.int64(0)

Step 7 : Correct any obvious data entry errors in the 'Age Column'

In [49]:
df['Salary'].apply(lambda x:x if x<90000 else var1)

0     172533.333333
1      35000.000000
2      50000.000000
3      70000.000000
4     172533.333333
5     172533.333333
6      20000.000000
7     172533.333333
8      35000.000000
9     172533.333333
10     70000.000000
11    172533.333333
12    172533.333333
13      2000.000000
14     16000.000000
15    172533.333333
16    172533.333333
Name: Salary, dtype: float64

In [34]:
# Step 9: Calculate the average salary by gender
salary_by_Gender= df.groupby('Gender')['Salary'].mean()
print(salary_by_Gender)

Gender
F    318755.555556
M     92775.757576
Name: Salary, dtype: float64

In [ ]:
salarycheckingbydesignation=df.groupby('Designation')['Salary'].mean()

In [43]:
salarycheckingbydesignation

Designation
Analyst       45000.000000
Engineer     443750.000000
Professor    115000.000000
Scientist    143766.666667
Teacher      103766.666667
engineer      90000.000000
professor    120000.000000
teacher        2000.000000
trainer       63000.000000
Name: Salary, dtype: float64

In [38]:
salarycheckingbyAge=df.groupby('Age')['Salary'].mean()

In [39]:
salarycheckingbyAge

Age
20.0     1.700000e+05
22.0     1.725333e+05
25.0     1.500000e+06
26.0     1.150000e+05
28.0     3.500000e+04
29.0     3.500000e+04
30.0     6.500000e+04
37.0     1.150000e+05
55.0     1.725333e+05
60.0     7.000000e+04
67.0     2.000000e+03
80.0     1.600000e+04
85.0     1.900000e+05
156.0    1.100000e+05
Name: Salary, dtype: float64

In [44]:
salarycheckingbydesignation=df.groupby('Designation')['Age'].mean()

In [45]:
salarycheckingbydesignation

Designation
Analyst       29.50
Engineer      41.75
Professor     37.00
Scientist     24.00
Teacher       42.50
engineer      30.00
professor     40.00
teacher       67.00
trainer      118.00
Name: Age, dtype: float64

In [46]:
higher_salary=df[df['Salary']>100000]
higher_salary

        Name Designation Gender    Age        Salary
0    Mukhtar   Professor      M   37.0  1.150000e+05
4      Babar    Engineer      F   25.0  1.500000e+06
5       Aqsa   Scientist      F   22.0  1.725333e+05
7      Samra   Scientist      F   26.0  1.150000e+05
9   Abdullah     Teacher      M   55.0  1.725333e+05
12     Ahsan     trainer      M  156.0  1.100000e+05
15    Qaisar   professor      M   20.0  1.700000e+05
16     Wajid    Engineer      M   85.0  1.900000e+05

In [50]:
sorted_df=df.sort_values(by='Age',ascending=False)
print(sorted_df)

             Name Designation Gender    Age        Salary
12          Ahsan     trainer      M  156.0  1.100000e+05
16          Wajid    Engineer      M   85.0  1.900000e+05
14          Naeem     trainer      M   80.0  1.600000e+04
13          Wajid     teacher      M   67.0  2.000000e+03
10          Mosib   professor      M   60.0  7.000000e+04
9        Abdullah     Teacher      M   55.0  1.725333e+05
0         Mukhtar   Professor      M   37.0  1.150000e+05
1           Azziz     Teacher      M   30.0  3.500000e+04
3   Naveed Fatima     Analyst      F   30.0  7.000000e+04
11          Ahmed    engineer      M   30.0  9.000000e+04
2          Mohsin    Engineer      M   29.0  5.000000e+04
6           Rafia     Analyst      F   29.0  2.000000e+04
8            Eman    Engineer      F   28.0  3.500000e+04
7           Samra   Scientist      F   26.0  1.150000e+05
4           Babar    Engineer      F   25.0  1.500000e+06
5            Aqsa   Scientist      F   22.0  1.725333e+05
15         Qaisar   professor      M   20.0  1.700000e+05

In [52]:
sorted_df=df.sort_values(by='Age',ascending=True)
print(sorted_df)

             Name Designation Gender    Age        Salary
15         Qaisar   professor      M   20.0  1.700000e+05
5            Aqsa   Scientist      F   22.0  1.725333e+05
4           Babar    Engineer      F   25.0  1.500000e+06
7           Samra   Scientist      F   26.0  1.150000e+05
8            Eman    Engineer      F   28.0  3.500000e+04
2          Mohsin    Engineer      M   29.0  5.000000e+04
6           Rafia     Analyst      F   29.0  2.000000e+04
1           Azziz     Teacher      M   30.0  3.500000e+04
11          Ahmed    engineer      M   30.0  9.000000e+04
3   Naveed Fatima     Analyst      F   30.0  7.000000e+04
0         Mukhtar   Professor      M   37.0  1.150000e+05
9        Abdullah     Teacher      M   55.0  1.725333e+05
10          Mosib   professor      M   60.0  7.000000e+04
13          Wajid     teacher      M   67.0  2.000000e+03
14          Naeem     trainer      M   80.0  1.600000e+04
16          Wajid    Engineer      M   85.0  1.900000e+05
12          Ahsan     trainer      M  156.0  1.100000e+05

In [53]:
# Save the cleaned DataFrame to a new CSV file

In [54]:
df.to_csv('Cleaned_data.csv', index=False)

In [55]:
print(df.describe())

              Age        Salary
count   17.000000  1.700000e+01
mean    47.588235  1.725333e+05
std     34.727617  3.473600e+05
min     20.000000  2.000000e+03
25%     28.000000  3.500000e+04
50%     30.000000  9.000000e+04
75%     60.000000  1.700000e+05
max    156.000000  1.500000e+06

In [56]:
df

             Name Designation Gender    Age        Salary
0         Mukhtar   Professor      M   37.0  1.150000e+05
1           Azziz     Teacher      M   30.0  3.500000e+04
2          Mohsin    Engineer      M   29.0  5.000000e+04
3   Naveed Fatima     Analyst      F   30.0  7.000000e+04
4           Babar    Engineer      F   25.0  1.500000e+06
5            Aqsa   Scientist      F   22.0  1.725333e+05
6           Rafia     Analyst      F   29.0  2.000000e+04
7           Samra   Scientist      F   26.0  1.150000e+05
8            Eman    Engineer      F   28.0  3.500000e+04
9        Abdullah     Teacher      M   55.0  1.725333e+05
10          Mosib   professor      M   60.0  7.000000e+04
11          Ahmed    engineer      M   30.0  9.000000e+04
12          Ahsan     trainer      M  156.0  1.100000e+05
13          Wajid     teacher      M   67.0  2.000000e+03
14          Naeem     trainer      M   80.0  1.600000e+04
15         Qaisar   professor      M   20.0  1.700000e+05
16          Wajid    Engineer      M   85.0  1.900000e+05